// The task is simple, you need to build a function that will calculate fibonaci numbers that are less then input number
// Тобто, потрібно знайти всі числа фібоначі які МЕНШІ за вказане число в функції
// Тести зроблені з допомогою jest -> універсальний інструмент для тестування коду
// запустити тести необхідно командою yarn test

/**
 * Функція це доволі проста штука. Вона використовується для того, що б певний функціонал можна було перевикористати в майбутньому
 * Також, зазвичай їх використовують, що б зробити код більш модульним, і це не перетворилося в одну велику програму яку не можливо підтримувати
 * export ключове слово, аби зробити видимою функцію поза межами даного файлу. В випадку просто js, це module.exports = {calcFib}; наприклад
 * */
export function calcFib(toNumber: number): number[] {
  console.log(toNumber);
  const fibArr: number[] = [];

  return fibArr;
}

// return ключове слово що б повернути результати виконання функції, тобто в даному випадку, ряд фібоначі
// важлива частина, назви в функції мають зону видимості тільки в функцій
function a() {
  const b = 0;

  return b;
}

function c() {
  a();
  const b = 5; // це b не має ніякого відношення до функції а()

  return b;
}

export function d(): number {
  const results = c();

  return results;
  // b з функції c тут не визначено
  // а отже не існує, результат с() не має конкретної назви змінної тут окрім як тої, яку ми задали, а тобто results
}
